## Group By

In [ ]:
#-- dosen dengan nama depan sam-
#SELECT *
#FROM teachers
#WHERE first_name LIKE "Sam%";

#-- dosen dengan nama depan -sam
#SELECT *
#FROM teachers
#WHERE first_name LIKE "%sam";

#-- dosen dengan nama depan mengandung -sam-
#SELECT *
#FROM teachers
#WHERE first_name LIKE "%sam";

#-- dosen max gaji
#SELECT max(salary)
#FROM teachers;

#-- rata rata gaji dosen
#SELECT avg(salary)
#FROM teachers;

#-- rata rata gaji dosen pembulatan kebawah
#SELECT floor(AVG(salary))
#FROM teachers;

#-- rata rata gaji dosen pembulatan keatas
#SELECT ceil(AVG(salary))
#FROM teachers;

#-- dosen max gaji
#-- cara #1, salah program running tapi tidak valid
#SELECT first_name, last_name, MAX(salary)
#from teachers

#-- cara #2, salah program tidak running
#SELECT first_name, last_name
#from teachers
#WHERE salary=MAX(salary);

#-- cara #3 subquerry
#SELECT first_name, last_name
#from teachers
#WHERE salary=(
#  select max(salary)
#  from teachers);

#-- dosen max gaji dari stanford
#SELECT first_name, last_name
#from teachers
#WHERE salary=(
#  select max(salary)
#  from teachers) AND school="Standford University";

## Joining

- Inner join = join yang di dua duanya ada
- Left join = Join yang di kiri
- Right join = join yang di kanan
- Outer join = union join between kiri dan kanan

In [ ]:
#-- penggabungan table teachers dengan courses
#SELECT *
#FROM teachers
#JOIN courses ON teachers.id=courses.teachers_id;

#-- melihat dosen yang mengajar calculus
#SELECT *
#FROM teachers
#JOIN courses ON teachers.id=courses.teachers_id
#WHERE courses.name="calculus";

#select di teachers jadi komponen teachers semuanya di tunjukan
#sementara komponen courses hanya yang inner join

#-- melihat jumlah matkul di setiap universitas
#SELECT teachers.school, count(courses.name) AS "Total Matkul"
#FROM teachers
#JOIN courses ON teachers.id=courses.teachers_id
#GROUP by teachers.school;

#-- melihat universitas apa saja yang total matkulnya lebih dari 3
#SELECT teachers.school, count(courses.name) AS total_matkul
#FROM teachers
#JOIN courses ON teachers.id=courses.teachers_id
#GROUP by teachers.school
#HAVING total_matkul>3;

#SELECT teachers.first_name, COUNT(courses.name) AS total_matkul
#FROM teachers
#JOIN courses ON teachers.id=courses.teachers_id
#GROUP by teachers.first_name
#ORDER BY total_matkul ASC;

### Hackerrank Practice

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.

In [ ]:
#filter city by distinct, so no dupe
#select distinct city 
#from station 
#where mod(id, 2)=0 
#mod (x, 2)= 0 is for even number, (x, 2)=1 for odd number

Given the CITY and COUNTRY tables, query the sum of the populations of all cities where the CONTINENT is 'Asia'.

In [ ]:
#select sum(city.population)
#from city
#join country on city.countrycode=country.code
#where country.continent="asia"

Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.

In [ ]:
#select city.name
#from city
#join country on city.countrycode=country.code
#where country.continent="africa"

Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer.

In [ ]:
#select country.continent, floor(avg((city.population)))
#from city
#join country on city.countrycode=country.code
#GROUP by country.continent

## Google Cloud

In [1]:
#select * 
#from `bigquery-public-data.chicago_crime.crime`
#where location_description="STREET"
#limit 1000

#-- melihat kejahatan unique di Chicago 
#select primary_type, count(*) as total_crime
#FROM `bigquery-public-data.chicago_crime.crime`
#group by primary_type
#order by total_crime desc;

Kunci jawaban NGC

https://github.com/danupurnomo/hacktiv8-exercises/blob/main/Non%20Graded%20Challenge/%5BANSWERS%5D%20Non%20Graded%20Challenge%2009%20-%20SQL.ipynb